# GroupedFabricationPartNotReposition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..GroupedFabricationPartNotReposition Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Failed to reposition part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupedFabricationPartNotReposition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupedFabricationPartNotReposition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupedFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace